{
  "Projects": [
    {
      "title": "Starlight UMN",
      "desc": [
        "Starlight is one of the student activities under the supervision of BEM Universias Multimedia Nusantara to accommodate and channel individual interests and talents. The Starlight Student Activity seeks to encourage the community to believe in the development of their respective talents."
      ],
      "year": "2024",
      "preview": "https://starlight.umn.ac.id/",
      "images": [
        "/projects/starlight/star1.png",
        "/projects/starlight/star2.png",
        "/projects/starlight/star3.png",
        "/projects/starlight/star4.png"
      ],
      "tech": [
        "React"
      ],
      "slug": "starlight"
    },
    {
      "title": "TVonair",
      "desc": [
        "Panel Discussion is a TVONAIR talk show event involving media practitioners and influencers with the theme \"The Future World of Digital Marketing and Visual Technology\", which highlights the development of social media and its potential in the future and invites young people and the public to play a role in increasing brand awareness through visuals storytelling and digital marketing.",
        "Sharing and Discussion (SnD) is a discussion forum for dozens of campus television media that raises current issues and their obstacles. With a round table conference concept, this year's SnD has the theme Collaborative Digital Media: Exploring Ethical Challenges, Social Responsibility, and Media Creativity. The focus is on collaboration between media to create innovation, different values, and understanding of ethics and social responsibility within the scope of media."
      ],
      "year": "2023",
      "preview": "https://tvonair.umn.ac.id/",
      "images": [
        "/projects/Tvonair/tv1.png",
        "/projects/Tvonair/tv2.png"
      ],
      "tech": [
        "JavaScript",
        "React"
      ],
      "slug": "tv-onair"
    },
    {
      "title": "OMB UMN 2024 (UI/UX designer)",
      "desc": [
        "In developing the prototypes and mockups for the OMBUMN 2024 website, we utilized Figma. We collaborated with the design division to acquire ",
        "assets created in Photoshop and worked closely with the public relations division to craft the website’s content and wording."
      ],
      "year": "2024",
      "preview": "https://omb.umn.ac.id/",
      "images": [
        "/projects/OMB2024/tools.png",
        "/projects/OMB2024/tools1.png",
        "/projects/OMB2024/tools2.png"
      ],
      "tech": [
        "Javascript",
        "React",
        "TailwindCSS"
      ],
      "slug": "OMB2024"
    },
    {
      "title": "Swara Pembangunan News",
      "desc": [
        "Swara Pembangunan News was my first project using WordPress CMS, where I developed a news channel website. We customized a WordPress theme to create a tailored news platform featuring categories such as nasional, Daerah, Ragam, Seni Budaya, Hiburan.",
        "We consistently post several news articles each week. The development phase took 2 days to adapt the theme for the news channel, and Swara Pembangunan News will continue to be updated with ongoing improvements to enhance user experience."
      ],
      "year": "2024",
      "preview": "https://swarapembangunannews.com/",
      "code": "https://github.com/Alvalens/aleph-discord-bot",
      "images": [
        "/projects/swaranews/sw1.png",
        "/projects/swaranews/sw2.png",
        "/projects/swaranews/sw3.png"
      ],
      "tech": [
        "WordPress",
        "Premium WordPress Theme"
      ],
      "slug": "swara-pembangunan-news"
    },
    {
      "title": "UMN HUB (UI/UX)",
      "desc": [
        "The umnHUB prototype is a redesigned version of the UNION UMN application. It uses the Genius Design method to understand the needs of UMN students while following the principles of the 8 Golden Rules.",
        "umnHUB includes new features and pays special attention to color composition, guided by the CoreDesignSystem.",
        "The purpose of umnHUB is to streamline academic processes, make it easier for students to access necessary information, provide more comprehensive services, simplify access to key features, and facilitate communication between students and lecturers within a single platform."
      ],
      "year": "2023",
      "preview": "https://www.figma.com/proto/NrGiRyIYgWAQqkLFEmK1An/ProjekUAS_Kelompok1_IF450_D_Aequorea?page-id=0%3A1&node-id=270-1930&starting-point-node-id=270%3A1930&t=HvDBfS58oPdrzxA1-1",
      "code": "",
      "images": [
        "/projects/HCI/HCI1.png",
        "/projects/HCI/HCI3.png",
        "/projects/HCI/HCI2.png"
      ],
      "tech": [
        "FIGMA"
      ],
      "slug": "HCI-FIGMA"
    },
    {
      "title": "The Great Adventure of Raka",
      "desc": [
        "This is my first project to develop a game using C# and Unity within 48 hours. Together with 6 other partners, we developed a game consisting of 4 programmers, ",
        "and 1 person each 2D artist, story maker, and game designer. We succeeded in developing a platformer game with a plant theme entitled \"The Great Adventure of Raka\".",
        "In the stage of making this game I learned a lot and was greatly helped by Faris Pradiatma as a programmer who worked on most of this project."
      ],
      "year": "2023",
      "preview": "https://globalgamejam.org/2023/games/great-adventure-raka-8",
      "code": "https://github.com/SashimiEnjoyer/Platformer-GGJ-2023",
      "images": [
        "/projects/GGJ/raka1.png",
        "/projects/GGJ/raka2.png",
        "/projects/GGJ/raka3.png",
        "/projects/GGJ/raka4.png"
      ],
      "tech": [
        "C#",
        "Unity"
      ],
      "slug": "raka-website"
    },
    {
      "title": "AIKO PETSHOP ",
      "desc": [
        "This project was quite challenging as I spent 3-4 days searching for clients or SMEs interested in a free profile website for my 3th semester final project. I went around Gading Serpong and faced 10 rejections before finally connecting with AIKO PETSHOP.",
        "The website was developed through several stages, starting with creating a flowchart, designing table relationships and the database, moving on to mockup creation, and culminating in the final development phase."
      ],
      "year": "2022",
      "code": "https://github.com/caleb-dinoto/AIKOPETSHOP",
      "images": [
        "/projects/petsop/petsop1.png",
        "/projects/petsop/petsop2.png",
        "/projects/petsop/petsop3.png",
        "/projects/petsop/petsop4.png",
        "/projects/petsop/petsop5.png"
      ],
      "tech": [
        "PHP",
        "Laravel",
        "Bootstrap",
        "MySQL"
      ],
      "slug": "PTI-projek"
    },
    {
      "title": "7 DAYS UMN",
      "desc": [
        "This project was my first experience using React to develop a website. The site was built with HTML, CSS, JavaScript, and React.",
        "I learned a lot about using React through this project, and I also gained experience with GitHub and Git. Additionally, this project served as the final assignment for my second-semester course."
      ],
      "year": "2022",
      "code": "https://github.com/caleb-dinoto/7DAYSUMN",
      "images": [
        "/projects/porto/7day.png",
        "/projects/porto/7day1.png",
        "/projects/porto/7day2.png",
        "/projects/porto/7day3.png"
      ],
      "tech": [
        "HTML",
        "Bootstrap",
        "CSS",
        "AOS",
        "JavaScript"
      ],
      "slug": "7-days-umn-webpro"
    }
  ]
}